prod-deploy/results/prod-01-5-rados-ec-vs-rep-mechanism-20260718-233945/cephfs-rep-baseline-clusternet-fixed/mseqwrite/fio.txt
mseqwrite: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 16 processes
mseqwrite: Laying out IO file (1 file / 4096MiB)
mseqwrite: Laying out IO file (1 file / 4096MiB)
mseqwrite: Laying out IO file (1 file / 4096MiB)
[...]

mseqwrite: (groupid=0, jobs=16): err= 0: pid=4009323: Sun Jul 19 22:18:42 2026
  write: IOPS=951, BW=3806MiB/s (3991MB/s)(64.0GiB/17218msec); 0 zone resets
    clat (msec): min=4, max=177, avg=15.91, stdev=11.50
     lat (msec): min=4, max=177, avg=15.91, stdev=11.50
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    8],
     | 30.00th=[    9], 40.00th=[   11], 50.00th=[   13], 60.00th=[   15],
     | 70.00th=[   18], 80.00th=[   23], 90.00th=[   31], 95.00th=[   37],
     | 99.00th=[   50], 99.50th=[   60], 99.90th=[  134], 99.95th=[  159],
     | 99.99th=[  178]
   bw (  MiB/s): min= 2540, max= 4432, per=100.00%, avg=3826.68, stdev=26.87, samples=265
   iops        : min=  454, max= 1204, avg=957.44, stdev= 8.72, samples=536
  lat (msec)   : 10=36.72%, 20=37.84%, 50=24.49%, 100=0.71%, 250=0.23%
  cpu          : usr=4.18%, sys=1.35%, ctx=29580, majf=1, minf=201
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3806MiB/s (3991MB/s), 3806MiB/s-3806MiB/s (3991MB/s-3991MB/s), io=64.0GiB (68.7GB), run=17218-17218msec